// what is ralu JS ?
/* 
js is a higly abstracted programing language
*/

/* 

V8 Engine এর mechanism সম্পর্কে একটু জানো। 

V8 ইঞ্জিন একটি প্রসিসরের মতো কাজ করে, যেটি কম্পিউটারের অন্যান্য সফটওয়্যার প্রোগ্রামগুলির মতো কাজ করে। তবে V8 একটি স্পেশালাইজড ইঞ্জিন যা উচ্চ স্পীডে জাভাস্ক্রিপ্ট কোড রান করতে উন্নয়ন করা হয়েছে।

V8 এর মেকানিজমে মূলত দুটি কাজ করে। একটি হল জাভাস্ক্রিপ্ট কোডকে মেমোরি তে লোড করা এবং দ্বিতীয়টি হল সেই কোডকে রান করা।

জাভাস্ক্রিপ্ট কোড রান করার আগে, V8 কোডটি ট্রান্সপাইল করে এবং একটি ইন্টারমিডিয়েট ল্যাঙ্গুয়েজে রূপান্তর করে।

*/


/* 

Single-threaded কি এবং জাভাস্ক্রিপ্ট এর কোন কোন জিনিস asynchronous সেটার একটা লিষ্ট  

Single-threaded মানে হলো যে প্রোগ্রামে শুধু একটি থ্রেড ব্যবহার করা হয়। এটি মূলত একটি প্রোগ্রামিং প্যারাডাইম যেখানে কোনও স্রষ্টা বা সাধারণত কোনও একটি জিনিস পরিষ্কার করতে একটি ক্রম অনুসারে কাজ করে।

জাভাস্ক্রিপ্টে কিছু asynchronous কাজগুলো হলো:

Callback Functions
Promises
Async/Await
Event Listeners
Timers (setTimeout, setInterval)
এই কাজগুলো asynchronous হওয়ার কারণে এটি সিঙ্গেল থ্রেড উপস্থিতিতেও একটি প্রোগ্রামিং ভাষা হিসেবে সক্ষম হয়।

*/

 
// setTimeout এর ভিতরে একটা কিছু কনসোল লগ করবে যেটা সাড়ে তিন সেকেন্ড পরে আউটপুট দেখাবে।

setTimeout(()=>{
    console.log('3.5 mini');
}, 3500)

